
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>《原则》 · irick's Blog</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="irick<happyirick@gmail.com>">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-multipart/multipart.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-toggle-chapters/toggle.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../ideas/" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://github.com/HappyiRick" target="_blank" class="custom-link">About me</a>
        </li>
    
        
        <li>
            <a href="https://happyirick.github.io/" target="_blank" class="custom-link">irick's Blog</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">技术</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../Terminal/">
            
                <a href="../Terminal/">
            
                    
                    终端开发
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../Terminal/iOS/">
            
                <a href="../Terminal/iOS/">
            
                    
                    iOS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1.1" data-path="../Terminal/iOS/iOSCodeGuidePractice.html">
            
                <a href="../Terminal/iOS/iOSCodeGuidePractice.html">
            
                    
                    iOS代码规范探索实践
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../Terminal/Android/">
            
                <a href="../Terminal/Android/">
            
                    
                    Android
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../Terminal/Web/">
            
                <a href="../Terminal/Web/">
            
                    
                    Web
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="../Terminal/小程序/">
            
                <a href="../Terminal/小程序/">
            
                    
                    小程序
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../LittleUP/">
            
                <a href="../LittleUP/">
            
                    
                    日有寸进
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../LittleUP/gitbookConfig.html">
            
                <a href="../LittleUP/gitbookConfig.html">
            
                    
                    Gitbook配置，开启写作之路 (上)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="../LittleUP/gitbookConfig_2.html">
            
                <a href="../LittleUP/gitbookConfig_2.html">
            
                    
                    Gitbook配置，开启写作之路 (下)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.3" data-path="../LittleUP/picturebedConfig.html">
            
                <a href="../LittleUP/picturebedConfig.html">
            
                    
                    Github+PicGo+jsDelivr创建稳定图床
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">生活</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="./">
            
                <a href="./">
            
                    
                    读书笔记
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="3.1.1" data-path="Principles.html">
            
                <a href="Principles.html">
            
                    
                    《原则》
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../ideas/">
            
                <a href="../ideas/">
            
                    
                    抛砖引玉
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >《原则》</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x300A;&#x539F;&#x5219;&#x300B;"><a name="&#x300A;&#x539F;&#x5219;&#x300B;" class="plugin-anchor" href="#&#x300A;&#x539F;&#x5219;&#x300B;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x300A;&#x539F;&#x5219;&#x300B;</h1>
<!-- toc -->
<ul>
<li><a href="#%E7%94%9F%E6%B4%BB%E5%8E%9F%E5%88%99">&#x751F;&#x6D3B;&#x539F;&#x5219;</a></li>
<li><a href="#%E5%B7%A5%E4%BD%9C%E5%8E%9F%E5%88%99">&#x5DE5;&#x4F5C;&#x539F;&#x5219;</a></li>
<li><a href="#%E6%80%BB%E7%BB%93">&#x603B;&#x7ED3;</a></li>
</ul>
<!-- tocstop -->
<blockquote>
<p>&#x5F88;&#x96BE;&#x5C06;&#x539F;&#x5219;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x822C;&#x7684;&#x6848;&#x4F8B;&#x6559;&#x5B66;&#x4E66;&#xFF0C;&#x4E0D;&#x4EC5;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x4F5C;&#x8005;&#x662F;&#x5927;&#x540D;&#x9F0E;&#x9F0E;&#x7684;&#x6865;&#x6C34;&#x57FA;&#x91D1;&#x521B;&#x59CB;&#x4EBA;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x5F88;&#x591A;&#x5EFA;&#x8BBE;&#x6027;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#x5B9E;&#x5728;&#x662F;&#x975E;&#x5E38;&#x5730;&#x63A5;&#x5730;&#x6C14;&#xFF0C;&#x4F8B;&#x5982;&#x8981;&#x6781;&#x5EA6;&#x6C42;&#x771F;&#x3001;&#x8981;&#x4FDD;&#x6301;&#x5FC3;&#x6001;&#x6781;&#x5EA6;&#x5F00;&#x653E;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x5BF9;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;&#x5230;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x540E;&#x53D1;&#x51FA;&#x7684;&#x7531;&#x8877;&#x7684;&#x611F;&#x6168;&#xFF0C;&#x672A;&#x80FD;&#x65E9;&#x70B9;&#x8BFB;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x9057;&#x61BE;&#x3002;</p>
<p>&#x4E66;&#x91CC;&#x4E00;&#x5171;&#x8BB2;&#x5230;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x9996;&#x5148;&#x8BB2;&#x4E86;&#x4F5C;&#x8005;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x5386;&#x53F2;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x70B9;&#x8C08;&#x5230;&#x4E86;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x7740;&#x5B9E;&#x8BA9;&#x4EBA;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#x3002;</p>
</blockquote>
<p>&#x672C;&#x6587;&#x91CD;&#x70B9;&#x8C08;&#x4E00;&#x8C08;&#x4E2A;&#x4EBA;&#x5BF9;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x539F;&#x5219;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<h2 id="&#x751F;&#x6D3B;&#x539F;&#x5219;"><a name="&#x751F;&#x6D3B;&#x539F;&#x5219;" class="plugin-anchor" href="#&#x751F;&#x6D3B;&#x539F;&#x5219;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x751F;&#x6D3B;&#x539F;&#x5219;</h2>
<p>&#x5728;&#x751F;&#x6D3B;&#x539F;&#x5219;&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x4E3B;&#x8981;&#x8BB2;&#x5230;&#x4E86;&#x4EBA;&#x7684;&#x5904;&#x4E8B;&#x539F;&#x5219;&#xFF0C;&#x505A;&#x4E8B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5FC3;&#x6001;&#xFF0C;&#x89C2;&#x70B9;&#xFF0C;&#x4EE5;&#x53CA;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x7684;&#x5904;&#x7406;&#x751F;&#x6D3B;&#x95EE;&#x9898;&#x7684;&#x51E0;&#x4E2A;&#x5173;&#x952E;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5F3A;&#x8C03;&#x4E86;&#x8981;&#x76F4;&#x9762;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x95EE;&#x9898;&#x6765;&#x4E34;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x91C7;&#x53D6;&#x8EB2;&#x907F;&#x6216;&#x8005;&#x62D6;&#x5EF6;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5E7B;&#x60F3;&#x89E3;&#x51B3;&#x5B83;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x4ECE;&#x5B9E;&#x9645;&#x51FA;&#x53D1;&#xFF0C;&#x505A;&#x597D;&#x89C2;&#x5BDF;&#xFF0C;&#x5206;&#x6790;&#x4E3B;&#x5BA2;&#x89C2;&#x6761;&#x4EF6;&#xFF0C;&#x6574;&#x7406;&#x8D44;&#x6E90;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x6240;&#x5904;&#x7684;&#x73AF;&#x5883;&#x505A;&#x51FA;&#x6E05;&#x6670;&#x7684;&#x5224;&#x65AD;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5728;&#x8BA4;&#x6E05;&#x5BA2;&#x89C2;&#x6761;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x638C;&#x63E1;&#x5177;&#x4F53;&#x5730;&#x505A;&#x4E8B;&#x65B9;&#x6CD5;&#xFF0C;&#x957F;&#x671F;&#x7684;&#x4E8B;&#x60C5;&#x957F;&#x671F;&#x505A;&#xFF0C;&#x89C4;&#x5212;&#x597D;&#x8FED;&#x4EE3;&#x7684;&#x5468;&#x671F;&#xFF0C;&#x77ED;&#x671F;&#x7684;&#x4E8B;&#x60C5;&#x5206;&#x9636;&#x6BB5;&#x505A;&#xFF0C;&#x786E;&#x5B9A;&#x597D;&#x4EA4;&#x4ED8;&#x7684;&#x7ED3;&#x70B9;&#xFF0C;&#x575A;&#x51B3;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x4E0D;&#x65AD;&#x63A8;&#x8FDB;&#x5BA2;&#x89C2;&#x4E8B;&#x7269;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x505A;&#x4E8B;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x65F6;&#x523B;&#x9762;&#x4E34;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x8981;&#x638C;&#x63E1;&#x5E94;&#x5BF9;&#x7A81;&#x53D1;&#x60C5;&#x51B5;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x89C2;&#x5BDF;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x6240;&#x7F3A;&#x6F0F;&#xFF0C;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x5BA2;&#x89C2;&#x6761;&#x4EF6;&#x7684;&#x638C;&#x63E1;&#x5E76;&#x4E0D;&#x5145;&#x5206;&#x548C;&#x6B63;&#x786E;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x5DE5;&#x4F5C;&#x5FC5;&#x7136;&#x6709;&#x6240;&#x7F3A;&#x9677;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x52C7;&#x6C14;&#x53BB;&#x627F;&#x8BA4;&#x548C;&#x5206;&#x6790;&#x8FD9;&#x79CD;&#x56F0;&#x5883;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x7684;&#x5934;&#x8111;&#x6781;&#x5EA6;&#x5F00;&#x653E;&#xFF0C;&#x80FD;&#x591F;&#x53BB;&#x627F;&#x8BA4;&#x548C;&#x63A5;&#x53D7;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x7684;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x5728;&#x751F;&#x6D3B;&#x7684;&#x5404;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x514D;&#x8981;&#x4E0E;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x4EBA;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x627F;&#x8BA4;&#x4EBA;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F02;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x54EA;&#x4E2A;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x65F6;&#x65F6;&#x523B;&#x523B;&#x90FD;&#x8981;&#x9762;&#x4E34;&#x5927;&#x91CF;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x5982;&#x4F55;&#x7B5B;&#x9009;&#x51FA;&#x5EFA;&#x8BBE;&#x6027;&#x7684;&#x51B3;&#x7B56;&#x573A;&#x666F;&#x5E76;&#x5C06;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x51B3;&#x7B56;&#x4E0A;&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<h2 id="&#x5DE5;&#x4F5C;&#x539F;&#x5219;"><a name="&#x5DE5;&#x4F5C;&#x539F;&#x5219;" class="plugin-anchor" href="#&#x5DE5;&#x4F5C;&#x539F;&#x5219;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5DE5;&#x4F5C;&#x539F;&#x5219;</h2>
<p>&#x5728;&#x5DE5;&#x4F5C;&#x539F;&#x5219;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x4E09;&#x4E2A;&#x8981;&#x7D20;&#xFF0C;<strong>&#x73AF;&#x5883;</strong>&#x3001;<strong>&#x4EBA;</strong>&#x3001;<strong>&#x7CFB;&#x7EDF;</strong>&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;&#x73AF;&#x5883;&#x5C06;&#x51B3;&#x5B9A;&#x4EBA;&#x4EEC;&#x505A;&#x4E8B;&#x7684;&#x5916;&#x56E0;&#xFF0C;&#x800C;&#x4EBA;&#x6C38;&#x8FDC;&#x662F;&#x505A;&#x4E8B;&#x7684;&#x7B2C;&#x4E00;&#x8981;&#x7D20;&#xFF0C;&#x7CFB;&#x7EDF;&#x5219;&#x80FD;&#x8BA9;&#x4E24;&#x8005;&#x53EF;&#x6301;&#x7EED;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x53BB;&#x4FEE;&#x6B63;&#x73AF;&#x5883;&#x548C;&#x53D1;&#x73B0;&#x6240;&#x9700;&#x8981;&#x7684;&#x4EBA;&#x624D;&#x3002;</p>
<p>&#x73AF;&#x5883;&#x4F5C;&#x4E3A;&#x571F;&#x58E4;&#xFF0C;&#x51B3;&#x5B9A;&#x7740;&#x5176;&#x4E0A;&#x80FD;&#x751F;&#x957F;&#x51FA;&#x4F55;&#x79CD;&#x8D28;&#x91CF;&#x7684;&#x679C;&#x5B9E;&#xFF0C;&#x597D;&#x7684;&#x73AF;&#x5883;&#x80FD;&#x591F;&#x5B55;&#x80B2;&#x51FA;&#x4E30;&#x76C8;&#x9971;&#x6EE1;&#x7684;&#x73CD;&#x9990;&#xFF0C;&#x800C;&#x574F;&#x7684;&#x571F;&#x58E4;&#x5F80;&#x5F80;&#x8BA9;&#x597D;&#x7684;&#x79CD;&#x5B50;&#x4E5F;&#x53EA;&#x80FD;&#x751F;&#x957F;&#x6210;&#x4E3A;&#x8425;&#x517B;&#x532E;&#x4E4F;&#x3001;&#x7FB8;&#x5F31;&#x65E0;&#x5473;&#x7684;&#x6B8B;&#x6B21;&#x54C1;&#x3002;&#x5728;&#x4E66;&#x4E2D;&#xFF0C;&#x63A8;&#x5D07;&#x516C;&#x53F8;&#x63A8;&#x884C;&#x6781;&#x5EA6;&#x6C42;&#x771F;&#x548C;&#x6781;&#x5EA6;&#x900F;&#x660E;&#x7684;&#x516C;&#x53F8;&#x6587;&#x5316;&#xFF0C;&#x53BB;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x4EE5;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x804C;&#x4E1A;&#x7684;&#x6001;&#x5EA6;&#x53BB;&#x7545;&#x8C08;&#x81EA;&#x5DF1;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5EFA;&#x7ACB;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x6587;&#x5316;&#x73AF;&#x5883;&#x4E4B;&#x540E;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x5219;&#x5305;&#x62EC;&#x505A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5B9E;&#x8DF5;&#x3001;&#x6C42;&#x540C;&#x5B58;&#x5F02;&#x3001;&#x5141;&#x8BB8;&#x72AF;&#x9519;&#x4F46;&#x4E0D;&#x80FD;&#x7F54;&#x987E;&#x6559;&#x8BAD;&#x3001;&#x5C0A;&#x91CD;&#x5BA2;&#x89C2;&#x3001;&#x8D85;&#x8D8A;&#x5206;&#x6B67;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4EBA;&#x6C38;&#x8FDC;&#x662F;&#x662F;&#x6267;&#x884C;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8981;&#x7D20;&#xFF0C;&#x4E66;&#x4E2D;&#x5BF9;&#x4EBA;&#x8FD9;&#x4E00;&#x8981;&#x7D20;&#x7684;&#x91CD;&#x89C6;&#x751A;&#x81F3;&#x8D85;&#x8D8A;&#x4E86;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x662F;&#x975E;&#x5E38;&#x8D5E;&#x540C;&#x7684;&#xFF0C;&#x8BB8;&#x662F;&#x6210;&#x957F;&#x73AF;&#x5883;&#x591A;&#x53D8;&#xFF0C;&#x63A5;&#x89E6;&#x7684;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x4EBA;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x5B66;&#x5386;&#x4E13;&#x4E1A;&#x5DE5;&#x4F5C;&#x7231;&#x597D;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x7136;&#x800C;&#x603B;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x7FA4;&#x4F53;&#x4E2D;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x5728;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x6807;&#x7B7E;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5F53;&#x4E0E;&#x4ED6;&#x4EEC;&#x5408;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x603B;&#x662F;&#x80FD;&#x591F;&#x653E;&#x5FC3;&#x5730;&#x5C06;&#x540E;&#x80CC;&#x4EA4;&#x7ED9;&#x4ED6;&#x4EEC;&#xFF0C;&#x7528;&#x53E3;&#x8BED;&#x6765;&#x5F62;&#x5BB9;&#x5C31;&#x662F;&#x9760;&#x8C31;&#xFF0C;&#x6839;&#x636E;&#x4E66;&#x4E2D;&#x6240;&#x5F3A;&#x8C03;&#x7684;&#xFF0C;&#x5728;&#x4EBA;&#x8FD9;&#x4E00;&#x8981;&#x7D20;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x5E94;&#x5949;&#x884C;&#x7684;&#x5B97;&#x65E8;&#x5C31;&#x662F;&#xFF1A;<strong>&#x627E;&#x80FD;&#x529B;&#x8FC7;&#x5173;&#x7684;&#x9760;&#x8C31;&#x7684;&#x4EBA;&#xFF0C;&#x57F9;&#x517B;&#x4ED6;&#x4EEC;&#xFF0C;&#x5E76;&#x7ED9;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x505A;&#x4E8B;&#x7684;&#x5E73;&#x53F0;</strong>&#x3002;</p>
<p>&#x6700;&#x540E;&#x5219;&#x662F;&#x8981;&#x5EFA;&#x7ACB;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD0;&#x52A8;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#xFF0C;&#x4EFB;&#x4F55;&#x73AF;&#x5883;&#x548C;&#x4EBA;&#x90FD;&#x4F1A;&#x5728;&#x53D1;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EA7;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4ECE;&#x800C;&#x504F;&#x79BB;&#x65E2;&#x5B9A;&#x7684;&#x8F68;&#x9053;&#xFF0C;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x5F80;&#x5F80;&#x88AB;&#x79F0;&#x4E3A;&#x71B5;&#x589E;&#xFF0C;&#x6307;&#x4EE3;&#x4E8B;&#x7269;&#x7684;&#x6DF7;&#x4E71;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E00;&#x65E6;&#x71B5;&#x5230;&#x8FBE;&#x4E86;&#x67D0;&#x79CD;&#x91CF;&#x7EA7;&#xFF0C;&#x5219;&#x4F1A;&#x63A8;&#x52A8;&#x539F;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x4EA7;&#x751F;&#x98A0;&#x8986;&#x6027;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4F9D;&#x6211;&#x4E4B;&#x89C1;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#xFF0C;&#x90FD;&#x662F;&#x5F15;&#x5BFC;&#x8FD9;&#x79CD;&#x71B5;&#x589E;&#x548C;&#x53D8;&#x5316;&#x53BB;&#x8D70;&#x5411;&#x6B63;&#x786E;&#x7684;&#x8F68;&#x9053;&#xFF0C;&#x4ECE;&#x800C;&#x63A8;&#x52A8;&#x4E8B;&#x60C5;&#x5411;&#x6211;&#x4EEC;&#x9884;&#x671F;&#x7684;&#x65B9;&#x5411;&#x5E73;&#x7A33;&#x53D1;&#x5C55;&#x3002;&#x4E66;&#x4E2D;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5177;&#x4F53;&#x63AA;&#x65BD;&#xFF0C;&#x5305;&#x62EC;&#x4E0D;&#x5BB9;&#x5FCD;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x3001;&#x63A2;&#x7A76;&#x95EE;&#x9898;&#x7684;&#x6839;&#x6E90;&#x3001;&#x5408;&#x7406;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3001;&#x5236;&#x5B9A;&#x8BA1;&#x5212;&#x5E76;&#x4FDD;&#x8BC1;&#x6309;&#x7167;&#x8BA1;&#x5212;&#x6267;&#x884C;&#x3001;&#x5F62;&#x6210;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x548C;&#x64CD;&#x4F5C;&#x624B;&#x518C;&#x3001;&#x5728;&#x601D;&#x60F3;&#x4E0A;&#x91CD;&#x89C6;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;"><a name="&#x603B;&#x7ED3;" class="plugin-anchor" href="#&#x603B;&#x7ED3;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x603B;&#x7ED3;</h2>
<p>&#x4ECE;&#x6211;&#x4E2A;&#x4EBA;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x672C;&#x539F;&#x5219;&#x4E0D;&#x4EC5;&#x662F;&#x8BB2;&#x8FF0;&#x4E86;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x4E8B;&#x60C5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x66F4;&#x662F;&#x5EFA;&#x7ACB;&#x4E00;&#x79CD;&#x4EE5;&#x5408;&#x4F5C;&#x5171;&#x8D62;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x89C2;&#x70B9;&#x8BB2;&#x7A76;&#x4EE5;&#x4EBA;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x8FFD;&#x6C42;&#x5934;&#x8111;&#x5F00;&#x653E;&#xFF0C;&#x5FC3;&#x6001;&#x5E73;&#x548C;&#xFF0C;&#x5C0A;&#x91CD;&#x5BA2;&#x89C2;&#x73B0;&#x5B9E;&#x7B49;&#x7279;&#x8D28;&#xFF0C;&#x53BB;&#x5B8C;&#x5584;&#x4F5C;&#x4E3A;&#x4EBA;&#x7684;&#x4E2A;&#x4F53;&#xFF0C;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x957F;&#x671F;&#x53D1;&#x5C55;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x7BA1;&#x7406;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5766;&#x7387;&#x9762;&#x5BF9;&#x81EA;&#x5DF1;&#xFF0C;&#x627F;&#x8BA4;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x5EFA;&#x7ACB;&#x8D77;&#x4E0E;&#x81EA;&#x5DF1;&#x5FC3;&#x667A;&#x7684;&#x6C9F;&#x901A;&#x4F53;&#x7CFB;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x5C55;&#x5236;&#x5B9A;&#x8BA1;&#x5212;&#xFF0C;&#x5E76;&#x957F;&#x671F;&#x575A;&#x6301;&#xFF0C;&#x6700;&#x7EC8;&#x5B8C;&#x5584;&#x81EA;&#x6211;&#xFF0C;&#x8FBE;&#x5230;&#x81EA;&#x6211;&#x6210;&#x529F;&#x7684;&#x5883;&#x754C;&#x3002;</p>
<p>&#x771F;&#x7684;&#x975E;&#x5E38;&#x63A8;&#x8350;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x5728;&#x4ECE;&#x4E8B;&#x4EC0;&#x4E48;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x90FD;&#x63A8;&#x8350;&#x4F60;&#x8BFB;&#x4E00;&#x8BFB;&#x3002;</p>
<!-- endtoc -->
<footer class="page-footer"><span class="copyright">Copyright &#xA9; happyirick 2022 all right reserved</span><span class="footer-modification">Post time:
2022-03-29 15:39:34
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 读书笔记">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../ideas/" class="navigation navigation-next " aria-label="Next page: 抛砖引玉">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"《原则》","level":"3.1.1","depth":2,"next":{"title":"抛砖引玉","level":"3.2","depth":1,"path":"ideas/README.md","ref":"ideas/README.md","articles":[]},"previous":{"title":"读书笔记","level":"3.1","depth":1,"path":"READNote/README.md","ref":"READNote/README.md","articles":[{"title":"《原则》","level":"3.1.1","depth":2,"path":"READNote/Principles.md","ref":"READNote/Principles.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-sharing","-lunr","-search","-fontsettings","multipart","simple-page-toc","page-toc-button","github","advanced-emoji","search-pro","code","copy-code-button","chapter-fold","splitter","expandable-chapters","back-to-top-button","lightbox","toggle-chapters","anchors","baidu-tongji","tbfed-pagefooter","insert-logo"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy happyirick 2022","modify_label":"Post time:","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"github":{"url":"https://github.com/HappyiRick"},"baidu-tongji":{"url":"https://hm.baidu.com/hm.js","token":"5370d7bf584be5cfd91dd00fcb82ba67"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"search-pro":{},"multipart":{},"code":{"copyButtons":true},"highlight":{},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{"maxTocDepth":2,"minTocSize":2},"back-to-top-button":{},"copy-code-button":{},"advanced-emoji":{"embedEmojis":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{},"toggle-chapters":{},"insert-logo":{"style":"background:none;min-height:196px;max-height:196px","url":"https://avatars.githubusercontent.com/u/16249555?s=400&u=45da22298bf8c55f726807d1ba94740343d14f20&v=4"},"expandable-chapters":{}},"theme":"default","author":"irick<happyirick@gmail.com>","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"irick's Blog","language":"zh-hans","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null},"sidebar":{"About me":"https://github.com/HappyiRick","irick's Blog":"https://happyirick.github.io/"}},"gitbook":"*","description":"A GitBook Blog for irick","extension":null},"file":{"path":"READNote/Principles.md","mtime":"2022-03-29T15:39:34.451Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-29T15:40:15.445Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-toggle-chapters/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baidu-tongji/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    

    </body>
</html>

